class __base(ADBDGameMode, 0) ADBDDebugGameMode
{
/* 0x0 */ struct ADBDDebugGameMode::VTable* vtable;
/* 0x8 */ __inherited enum EObjectFlags UObjectBase::ObjectFlags;
/* 0xc */ __inherited int32_t UObjectBase::InternalIndex;
/* 0x10 */ __inherited class UClass* UObjectBase::ClassPrivate;
/* 0x18 */ __inherited class FName UObjectBase::NamePrivate;
/* 0x20 */ __inherited class UObject* UObjectBase::OuterPrivate;
/* 0x28 */ __inherited struct FActorTickFunction AActor::PrimaryActorTick;
/* 0x78 */ __inherited float AActor::CustomTimeDilation;
/* 0x7c */ __inherited union
{
    /* 0x7c + 0x1 */ uint8_t bHidden;
    /* 0x7c + 0x2 */ uint8_t bNetTemporary;
    /* 0x7c + 0x4 */ uint8_t bNetStartup;
    /* 0x7c + 0x8 */ uint8_t bOnlyRelevantToOwner;
    /* 0x7c + 0x10 */ uint8_t bAlwaysRelevant;
    /* 0x7c + 0x20 */ uint8_t bReplicateMovement;
    /* 0x7c + 0x40 */ uint8_t bTearOff;
    /* 0x7c + 0x80 */ uint8_t bExchangedRoles;
} __bitfield7c;
/* 0x7d */ __inherited union
{
    /* 0x7d + 0x1 */ uint8_t bPendingNetUpdate;
    /* 0x7d + 0x2 */ uint8_t bNetLoadOnClient;
    /* 0x7d + 0x4 */ uint8_t bNetUseOwnerRelevancy;
    /* 0x7d + 0x8 */ uint8_t bBlockInput;
    /* 0x7d + 0x10 */ uint8_t bRunningUserConstructionScript;
    /* 0x7d + 0x20 */ uint8_t bAllowTickBeforeBeginPlay;
    /* 0x7d + 0x40 */ uint8_t bHasFinishedSpawning;
    /* 0x7d + 0x80 */ uint8_t bTickFunctionsRegistered;
} __bitfield7d;
/* 0x7e */ __inherited union
{
    /* 0x7e + 0x1 */ uint8_t bActorEnableCollision;
    /* 0x7e + 0x2 */ uint8_t bNetCheckedInitialPhysicsState;
    /* 0x7e + 0x4 */ uint8_t bReplicates;
} __bitfield7e;
/* 0x7f */ __padding char _7f[1];
/* 0x80 */ __inherited class FName AActor::NetDriverName;
/* 0x88 */ __inherited class TEnumAsByte<enum ENetRole> AActor::RemoteRole;
/* 0x90 */ __inherited class AActor* AActor::Owner;
/* 0x98 */ __inherited struct FRepMovement AActor::ReplicatedMovement;
/* 0xcc */ __padding char _cc[4];
/* 0xd0 */ __inherited struct FRepAttachment AActor::AttachmentReplication;
/* 0x110 */ __inherited class TEnumAsByte<enum ENetRole> AActor::Role;
/* 0x111 */ __inherited class TEnumAsByte<enum ENetDormancy> AActor::NetDormancy;
/* 0x112 */ __inherited class TEnumAsByte<enum EAutoReceiveInput::Type> AActor::AutoReceiveInput;
/* 0x114 */ __inherited int32_t AActor::InputPriority;
/* 0x118 */ __inherited class UInputComponent* AActor::InputComponent;
/* 0x120 */ __inherited class TEnumAsByte<enum EInputConsumeOptions> AActor::InputConsumeOption_DEPRECATED;
/* 0x124 */ __inherited float AActor::NetCullDistanceSquared;
/* 0x128 */ __inherited int32_t AActor::NetTag;
/* 0x12c */ __inherited float AActor::NetUpdateTime;
/* 0x130 */ __inherited float AActor::NetUpdateFrequency;
/* 0x134 */ __inherited float AActor::MinNetUpdateFrequency;
/* 0x138 */ __inherited float AActor::NetPriority;
/* 0x13c */ __inherited float AActor::LastNetUpdateTime;
/* 0x140 */ __inherited union
{
    /* 0x140 + 0x1 */ uint8_t bAutoDestroyWhenFinished;
    /* 0x140 + 0x2 */ uint8_t bCanBeDamaged;
    /* 0x140 + 0x4 */ uint8_t bActorIsBeingDestroyed;
    /* 0x140 + 0x8 */ uint8_t bCollideWhenPlacing;
    /* 0x140 + 0x10 */ uint8_t bFindCameraComponentWhenViewTarget;
    /* 0x140 + 0x20 */ uint8_t bRelevantForNetworkReplays;
    /* 0x140 + 0x40 */ uint8_t bGenerateOverlapEventsDuringLevelStreaming;
} __bitfield140;
/* 0x141 */ __inherited enum ESpawnActorCollisionHandlingMethod AActor::SpawnCollisionHandlingMethod;
/* 0x144 */ __inherited float AActor::CreationTime;
/* 0x148 */ __inherited class APawn* AActor::Instigator;
/* 0x150 */ __inherited class TArray<AActor *,FDefaultAllocator> AActor::Children;
/* 0x160 */ __inherited class USceneComponent* AActor::RootComponent;
/* 0x168 */ __inherited class TArray<AMatineeActor *,FDefaultAllocator> AActor::ControllingMatineeActors;
/* 0x178 */ __inherited float AActor::InitialLifeSpan;
/* 0x17c */ __padding char _17c[4];
/* 0x180 */ __inherited struct FTimerHandle AActor::TimerHandle_LifeSpanExpired;
/* 0x188 */ __inherited class TArray<FName,FDefaultAllocator> AActor::Layers;
/* 0x198 */ __inherited struct TWeakObjectPtr<AActor,FWeakObjectPtr> AActor::ParentComponentActor_DEPRECATED;
/* 0x1a0 */ __inherited struct TWeakObjectPtr<UChildActorComponent,FWeakObjectPtr> AActor::ParentComponent;
/* 0x1a8 */ __inherited union
{
    /* 0x1a8 + 0x1 */ uint8_t bAllowReceiveTickEventOnDedicatedServer;
    /* 0x1a8 + 0x2 */ uint8_t bActorInitialized;
    /* 0x1a8 + 0x4 */ enum AActor::EActorBeginPlayState ActorHasBegunPlay;
    /* 0x1a8 + 0x8 */ uint8_t bActorSeamlessTraveled;
    /* 0x1a8 + 0x10 */ uint8_t bIgnoresOriginShifting;
    /* 0x1a8 + 0x20 */ uint8_t bEnableAutoLODGeneration;
} __bitfield1a8;
/* 0x1a9 */ __padding char _1a9[7];
/* 0x1b0 */ __inherited class TArray<FName,FDefaultAllocator> AActor::Tags;
/* 0x1c0 */ __inherited uint64_t AActor::HiddenEditorViews;
/* 0x1c8 */ __inherited class FTakeAnyDamageSignature AActor::OnTakeAnyDamage;
/* 0x1d8 */ __inherited class FTakePointDamageSignature AActor::OnTakePointDamage;
/* 0x1e8 */ __inherited class FActorBeginOverlapSignature AActor::OnActorBeginOverlap;
/* 0x1f8 */ __inherited class FActorEndOverlapSignature AActor::OnActorEndOverlap;
/* 0x208 */ __inherited class FActorBeginCursorOverSignature AActor::OnBeginCursorOver;
/* 0x218 */ __inherited class FActorEndCursorOverSignature AActor::OnEndCursorOver;
/* 0x228 */ __inherited class FActorOnClickedSignature AActor::OnClicked;
/* 0x238 */ __inherited class FActorOnReleasedSignature AActor::OnReleased;
/* 0x248 */ __inherited class FActorOnInputTouchBeginSignature AActor::OnInputTouchBegin;
/* 0x258 */ __inherited class FActorOnInputTouchEndSignature AActor::OnInputTouchEnd;
/* 0x268 */ __inherited class FActorBeginTouchOverSignature AActor::OnInputTouchEnter;
/* 0x278 */ __inherited class FActorEndTouchOverSignature AActor::OnInputTouchLeave;
/* 0x288 */ __inherited class FActorHitSignature AActor::OnActorHit;
/* 0x298 */ __inherited class FActorDestroyedSignature AActor::OnDestroyed;
/* 0x2a8 */ __inherited class FActorEndPlaySignature AActor::OnEndPlay;
/* 0x2b8 */ __inherited class TSet<UActorComponent *,DefaultKeyFuncs<UActorComponent *,0>,FDefaultSetAllocator> AActor::OwnedComponents;
/* 0x308 */ __inherited class TSet<UActorComponent *,DefaultKeyFuncs<UActorComponent *,0>,FDefaultSetAllocator> AActor::ReplicatedComponents;
/* 0x358 */ __inherited class TArray<UActorComponent *,FDefaultAllocator> AActor::BlueprintCreatedComponents;
/* 0x368 */ __inherited class TArray<UActorComponent *,FDefaultAllocator> AActor::InstanceComponents;
/* 0x378 */ __inherited class FRenderCommandFence AActor::DetachFence;
/* 0x380 */ __inherited class FName AGameMode::MatchState;
/* 0x388 */ __inherited union
{
    /* 0x388 + 0x1 */ uint32_t bUseSeamlessTravel;
    /* 0x388 + 0x2 */ uint32_t bPauseable;
    /* 0x388 + 0x4 */ uint32_t bStartPlayersAsSpectators;
    /* 0x388 + 0x8 */ uint32_t bDelayedStart;
} __bitfield388;
/* 0x38c */ __padding char _38c[4];
/* 0x390 */ __inherited class FString AGameMode::OptionsString;
/* 0x3a0 */ __inherited class TSubclassOf<APawn> AGameMode::DefaultPawnClass;
/* 0x3a8 */ __inherited class TSubclassOf<AHUD> AGameMode::HUDClass;
/* 0x3b0 */ __inherited int32_t AGameMode::NumSpectators;
/* 0x3b4 */ __inherited int32_t AGameMode::NumPlayers;
/* 0x3b8 */ __inherited int32_t AGameMode::NumBots;
/* 0x3bc */ __inherited float AGameMode::MinRespawnDelay;
/* 0x3c0 */ __inherited class AGameSession* AGameMode::GameSession;
/* 0x3c8 */ __inherited int32_t AGameMode::NumTravellingPlayers;
/* 0x3cc */ __inherited int32_t AGameMode::CurrentID;
/* 0x3d0 */ __inherited class FText AGameMode::DefaultPlayerName;
/* 0x3e8 */ __inherited class TSubclassOf<ULocalMessage> AGameMode::EngineMessageClass;
/* 0x3f0 */ __inherited class TSubclassOf<APlayerController> AGameMode::PlayerControllerClass;
/* 0x3f8 */ __inherited class TSubclassOf<ASpectatorPawn> AGameMode::SpectatorClass;
/* 0x400 */ __inherited class TSubclassOf<APlayerController> AGameMode::ReplaySpectatorPlayerControllerClass;
/* 0x408 */ __inherited class TSubclassOf<APlayerState> AGameMode::PlayerStateClass;
/* 0x410 */ __inherited class TSubclassOf<AGameState> AGameMode::GameStateClass;
/* 0x418 */ __inherited class AGameState* AGameMode::GameState;
/* 0x420 */ __inherited class TArray<APlayerState *,FDefaultAllocator> AGameMode::InactivePlayerArray;
/* 0x430 */ __inherited class TArray<TBaseDelegate<bool>,FDefaultAllocator> AGameMode::Pausers;
/* 0x440 */ __inherited class TArray<FGameClassShortName,FDefaultAllocator> AGameMode::GameModeClassAliases;
/* 0x450 */ __inherited float AGameMode::InactivePlayerStateLifeSpan;
/* 0x454 */ __inherited uint8_t AGameMode::bHandleDedicatedServerReplays;
/* 0x455 */ __padding char _455[3];
/* 0x458 */ __inherited uint8_t ADBDGameMode::StartWithSlasher;
/* 0x459 */ __inherited uint8_t ADBDGameMode::EscapeOpened;
/* 0x45a */ __padding char _45a[6];
/* 0x460 */ __inherited class TArray<APlayerStart *,FDefaultAllocator> ADBDGameMode::_initialPlayerStarts;
/* 0x470 */ __inherited uint8_t ADBDGameMode::_proceduralMode;
/* 0x471 */ __inherited uint8_t ADBDGameMode::_gameRestarted;
/* 0x472 */ __inherited enum ELevelLoadingSteps ADBDGameMode::_currentLevelLoadingStep;
/* 0x474 */ __inherited uint32_t ADBDGameMode::_debugCurrentCamperIndex;
/* 0x478 */ __inherited struct FDBDTimer ADBDGameMode::_gameLevelLoadingTimeOutTimer;
/* 0x498 */ __inherited uint8_t ADBDGameMode::_levelLoadingTimeoutSent;
/* 0x499 */ __padding char _499[7];
/* 0x4a0 */ __inherited class FString ADBDGameMode::_readyDebugString;
/* 0x4b0 */ __inherited float const ADBDGameMode::kGameLevelLoadedMaxTime;
/* 0x4b4 */ __padding char _4b4[4];
/* 0x4b8 */ __inherited struct FDateTime ADBDGameMode::_matchStartTime;
/* 0x4c0 */ __inherited int32_t ADBDGameMode::_killerGoalPoints;
/* 0x4c4 */ __inherited uint8_t ADBDGameMode::_dcCheckNeedsResponse;
/* 0x4c8 */ __inherited int32_t ADBDGameMode::_networkCheckFailCount;
/* 0x4cc */ __inherited struct FDBDTimer ADBDGameMode::_networkCheckFailTimer;
/* 0x4ec */ __inherited int32_t ADBDGameMode::_networkCheckIndex;
/* 0x4f0 */ __inherited uint64_t ADBDGameMode::_networkCheckResults;
/* 0x4f8 */ class TArray<TSubclassOf<ACamperPlayer>,FDefaultAllocator> CamperPawnOverrides;
/* 0x508 */ class TArray<TSubclassOf<ASlasherPlayer>,FDefaultAllocator> SlasherPawnOverrides;
/* 0x518 */ int32_t _currentCamperIndex;
/* 0x51c */ __padding char _51c[4];
};