class __base(AGameMode, 0) ADBDGame_Start
{
/* 0x0 */ struct ADBDGame_Start::VTable* vtable;
/* 0x8 */ enum EObjectFlags UObjectBase::ObjectFlags;
/* 0xc */ int32_t UObjectBase::InternalIndex;
/* 0x10 */ class UClass* UObjectBase::ClassPrivate;
/* 0x18 */ class FName UObjectBase::NamePrivate;
/* 0x20 */ class UObject* UObjectBase::OuterPrivate;
/* 0x28 */ struct FActorTickFunction AActor::PrimaryActorTick;
/* 0x78 */ float AActor::CustomTimeDilation;
/* 0x7c */ union
{
    /* 0x7c + 0x01 */ uint8_t bHidden;
    /* 0x7c + 0x02 */ uint8_t bNetTemporary;
    /* 0x7c + 0x04 */ uint8_t bNetStartup;
    /* 0x7c + 0x08 */ uint8_t bOnlyRelevantToOwner;
    /* 0x7c + 0x10 */ uint8_t bAlwaysRelevant;
    /* 0x7c + 0x20 */ uint8_t bReplicateMovement;
    /* 0x7c + 0x40 */ uint8_t bTearOff;
    /* 0x7c + 0x80 */ uint8_t bExchangedRoles;
} __bitfield7c;
/* 0x7d */ union
{
    /* 0x7d + 0x01 */ uint8_t bPendingNetUpdate;
    /* 0x7d + 0x02 */ uint8_t bNetLoadOnClient;
    /* 0x7d + 0x04 */ uint8_t bNetUseOwnerRelevancy;
    /* 0x7d + 0x08 */ uint8_t bBlockInput;
    /* 0x7d + 0x10 */ uint8_t bRunningUserConstructionScript;
    /* 0x7d + 0x20 */ uint8_t bAllowTickBeforeBeginPlay;
    /* 0x7d + 0x40 */ uint8_t bHasFinishedSpawning;
    /* 0x7d + 0x80 */ uint8_t bTickFunctionsRegistered;
} __bitfield7d;
/* 0x7e */ union
{
    /* 0x7e + 0x01 */ uint8_t bActorEnableCollision;
    /* 0x7e + 0x02 */ uint8_t bNetCheckedInitialPhysicsState;
    /* 0x7e + 0x04 */ uint8_t bReplicates;
} __bitfield7e;
/* 0x7f */ char _7f[1];
/* 0x80 */ class FName AActor::NetDriverName;
/* 0x88 */ class TEnumAsByte<enum ENetRole> AActor::RemoteRole;
/* 0x90 */ class AActor* AActor::Owner;
/* 0x98 */ struct FRepMovement AActor::ReplicatedMovement;
/* 0xcc */ char _cc[4];
/* 0xd0 */ struct FRepAttachment AActor::AttachmentReplication;
/* 0x110 */ class TEnumAsByte<enum ENetRole> AActor::Role;
/* 0x111 */ class TEnumAsByte<enum ENetDormancy> AActor::NetDormancy;
/* 0x112 */ class TEnumAsByte<enum EAutoReceiveInput::Type> AActor::AutoReceiveInput;
/* 0x114 */ int32_t AActor::InputPriority;
/* 0x118 */ class UInputComponent* AActor::InputComponent;
/* 0x120 */ class TEnumAsByte<enum EInputConsumeOptions> AActor::InputConsumeOption_DEPRECATED;
/* 0x124 */ float AActor::NetCullDistanceSquared;
/* 0x128 */ int32_t AActor::NetTag;
/* 0x12c */ float AActor::NetUpdateTime;
/* 0x130 */ float AActor::NetUpdateFrequency;
/* 0x134 */ float AActor::MinNetUpdateFrequency;
/* 0x138 */ float AActor::NetPriority;
/* 0x13c */ float AActor::LastNetUpdateTime;
/* 0x140 */ union
{
    /* 0x140 + 0x01 */ uint8_t bAutoDestroyWhenFinished;
    /* 0x140 + 0x02 */ uint8_t bCanBeDamaged;
    /* 0x140 + 0x04 */ uint8_t bActorIsBeingDestroyed;
    /* 0x140 + 0x08 */ uint8_t bCollideWhenPlacing;
    /* 0x140 + 0x10 */ uint8_t bFindCameraComponentWhenViewTarget;
    /* 0x140 + 0x20 */ uint8_t bRelevantForNetworkReplays;
    /* 0x140 + 0x40 */ uint8_t bGenerateOverlapEventsDuringLevelStreaming;
} __bitfield140;
/* 0x141 */ enum ESpawnActorCollisionHandlingMethod AActor::SpawnCollisionHandlingMethod;
/* 0x144 */ float AActor::CreationTime;
/* 0x148 */ class APawn* AActor::Instigator;
/* 0x150 */ class TArray<AActor *,FDefaultAllocator> AActor::Children;
/* 0x160 */ class USceneComponent* AActor::RootComponent;
/* 0x168 */ class TArray<AMatineeActor *,FDefaultAllocator> AActor::ControllingMatineeActors;
/* 0x178 */ float AActor::InitialLifeSpan;
/* 0x17c */ char _17c[4];
/* 0x180 */ struct FTimerHandle AActor::TimerHandle_LifeSpanExpired;
/* 0x188 */ class TArray<FName,FDefaultAllocator> AActor::Layers;
/* 0x198 */ struct TWeakObjectPtr<AActor,FWeakObjectPtr> AActor::ParentComponentActor_DEPRECATED;
/* 0x1a0 */ struct TWeakObjectPtr<UChildActorComponent,FWeakObjectPtr> AActor::ParentComponent;
/* 0x1a8 */ union
{
    /* 0x1a8 + 0x01 */ uint8_t bAllowReceiveTickEventOnDedicatedServer;
    /* 0x1a8 + 0x02 */ uint8_t bActorInitialized;
    /* 0x1a8 + 0x04 */ enum AActor::EActorBeginPlayState ActorHasBegunPlay;
    /* 0x1a8 + 0x08 */ uint8_t bActorSeamlessTraveled;
    /* 0x1a8 + 0x10 */ uint8_t bIgnoresOriginShifting;
    /* 0x1a8 + 0x20 */ uint8_t bEnableAutoLODGeneration;
} __bitfield1a8;
/* 0x1a9 */ char _1a9[7];
/* 0x1b0 */ class TArray<FName,FDefaultAllocator> AActor::Tags;
/* 0x1c0 */ uint64_t AActor::HiddenEditorViews;
/* 0x1c8 */ class FTakeAnyDamageSignature AActor::OnTakeAnyDamage;
/* 0x1d8 */ class FTakePointDamageSignature AActor::OnTakePointDamage;
/* 0x1e8 */ class FActorBeginOverlapSignature AActor::OnActorBeginOverlap;
/* 0x1f8 */ class FActorEndOverlapSignature AActor::OnActorEndOverlap;
/* 0x208 */ class FActorBeginCursorOverSignature AActor::OnBeginCursorOver;
/* 0x218 */ class FActorEndCursorOverSignature AActor::OnEndCursorOver;
/* 0x228 */ class FActorOnClickedSignature AActor::OnClicked;
/* 0x238 */ class FActorOnReleasedSignature AActor::OnReleased;
/* 0x248 */ class FActorOnInputTouchBeginSignature AActor::OnInputTouchBegin;
/* 0x258 */ class FActorOnInputTouchEndSignature AActor::OnInputTouchEnd;
/* 0x268 */ class FActorBeginTouchOverSignature AActor::OnInputTouchEnter;
/* 0x278 */ class FActorEndTouchOverSignature AActor::OnInputTouchLeave;
/* 0x288 */ class FActorHitSignature AActor::OnActorHit;
/* 0x298 */ class FActorDestroyedSignature AActor::OnDestroyed;
/* 0x2a8 */ class FActorEndPlaySignature AActor::OnEndPlay;
/* 0x2b8 */ class TSet<UActorComponent *,DefaultKeyFuncs<UActorComponent *,0>,FDefaultSetAllocator> AActor::OwnedComponents;
/* 0x308 */ class TSet<UActorComponent *,DefaultKeyFuncs<UActorComponent *,0>,FDefaultSetAllocator> AActor::ReplicatedComponents;
/* 0x358 */ class TArray<UActorComponent *,FDefaultAllocator> AActor::BlueprintCreatedComponents;
/* 0x368 */ class TArray<UActorComponent *,FDefaultAllocator> AActor::InstanceComponents;
/* 0x378 */ class FRenderCommandFence AActor::DetachFence;
/* 0x380 */ class FName AGameMode::MatchState;
/* 0x388 */ union
{
    /* 0x388 + 0x01 */ uint32_t bUseSeamlessTravel;
    /* 0x388 + 0x02 */ uint32_t bPauseable;
    /* 0x388 + 0x04 */ uint32_t bStartPlayersAsSpectators;
    /* 0x388 + 0x08 */ uint32_t bDelayedStart;
} __bitfield388;
/* 0x390 */ class FString AGameMode::OptionsString;
/* 0x3a0 */ class TSubclassOf<APawn> AGameMode::DefaultPawnClass;
/* 0x3a8 */ class TSubclassOf<AHUD> AGameMode::HUDClass;
/* 0x3b0 */ int32_t AGameMode::NumSpectators;
/* 0x3b4 */ int32_t AGameMode::NumPlayers;
/* 0x3b8 */ int32_t AGameMode::NumBots;
/* 0x3bc */ float AGameMode::MinRespawnDelay;
/* 0x3c0 */ class AGameSession* AGameMode::GameSession;
/* 0x3c8 */ int32_t AGameMode::NumTravellingPlayers;
/* 0x3cc */ int32_t AGameMode::CurrentID;
/* 0x3d0 */ class FText AGameMode::DefaultPlayerName;
/* 0x3e8 */ class TSubclassOf<ULocalMessage> AGameMode::EngineMessageClass;
/* 0x3f0 */ class TSubclassOf<APlayerController> AGameMode::PlayerControllerClass;
/* 0x3f8 */ class TSubclassOf<ASpectatorPawn> AGameMode::SpectatorClass;
/* 0x400 */ class TSubclassOf<APlayerController> AGameMode::ReplaySpectatorPlayerControllerClass;
/* 0x408 */ class TSubclassOf<APlayerState> AGameMode::PlayerStateClass;
/* 0x410 */ class TSubclassOf<AGameState> AGameMode::GameStateClass;
/* 0x418 */ class AGameState* AGameMode::GameState;
/* 0x420 */ class TArray<APlayerState *,FDefaultAllocator> AGameMode::InactivePlayerArray;
/* 0x430 */ class TArray<TBaseDelegate<bool>,FDefaultAllocator> AGameMode::Pausers;
/* 0x440 */ class TArray<FGameClassShortName,FDefaultAllocator> AGameMode::GameModeClassAliases;
/* 0x450 */ float AGameMode::InactivePlayerStateLifeSpan;
/* 0x454 */ uint8_t AGameMode::bHandleDedicatedServerReplays;
/* 0x455 */ char _455[0xb];
/* 0x460 */ class ADBDGame_Start::FOnDBBInitComplete OnDBDInitComplete;
/* 0x4d0 */ enum ELoadProgress _loadProgress;
/* 0x4d1 */ enum ELoadCompleteState _loadCompletionState;
/* 0x4d2 */ enum EDeferredError _deferredError;
/* 0x4d3 */ char _4d3[5];
/* 0x4d8 */ struct FTimerHandle _timeoutHandle;
/* 0x4e0 */ class FDelegateHandle _generateAuthTicketHandle;
/* 0x4e8 */ class FDelegateHandle _initEACHandle;
/* 0x4f0 */ class FDelegateHandle _loadProfileHandle;
/* 0x4f8 */ class FDelegateHandle _loadStatsHandle;
/* 0x500 */ class FDelegateHandle _loadCurrenciesHandle;
/* 0x508 */ char _508[8];
};